read_verilog 6input_7.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./7/6input_7_yosys
write_edif ./7/6input_7.edif
write_json ./7/6input_7.json
