read_verilog 8input_78.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./78/8input_78_yosys
write_edif ./78/8input_78.edif
write_json ./78/8input_78.json
