read_verilog 7input_70.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./70/7input_70_yosys
write_edif ./70/7input_70.edif
write_json ./70/7input_70.json
