read_verilog 7input_50.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./50/7input_50_yosys
write_edif ./50/7input_50.edif
write_json ./50/7input_50.json
