read_verilog ./Circuits/Graycode/gray4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Graycode/gray4/gray4_yosys
write_edif ./Circuits/Graycode/gray4/gray4.edif
write_json ./Circuits/Graycode/gray4/gray4.json
