read_verilog 7input_55.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./55/7input_55_yosys
write_edif ./55/7input_55.edif
write_json ./55/7input_55.json
