read_verilog 4input_374.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./374/4input_374_yosys
write_edif ./374/4input_374.edif
write_json ./374/4input_374.json
