read_verilog 8input_2.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./2/8input_2_yosys
write_edif ./2/8input_2.edif
write_json ./2/8input_2.json
