read_verilog 7input_52.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./52/7input_52_yosys
write_edif ./52/7input_52.edif
write_json ./52/7input_52.json
