read_verilog 6input_99.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./99/6input_99_yosys
write_edif ./99/6input_99.edif
write_json ./99/6input_99.json
