read_verilog 6input_49.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./49/6input_49_yosys
write_edif ./49/6input_49.edif
write_json ./49/6input_49.json
