read_verilog 7input_41.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./41/7input_41_yosys
write_edif ./41/7input_41.edif
write_json ./41/7input_41.json
