read_verilog 7input_11.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./11/7input_11_yosys
write_edif ./11/7input_11.edif
write_json ./11/7input_11.json
