read_verilog ./Circuits/Graycode/gray8.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Graycode/gray8/gray8_yosys
write_edif ./Circuits/Graycode/gray8/gray8.edif
write_json ./Circuits/Graycode/gray8/gray8.json
