read_verilog 8input_9.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./9/8input_9_yosys
write_edif ./9/8input_9.edif
write_json ./9/8input_9.json
