read_verilog 8input_69.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./69/8input_69_yosys
write_edif ./69/8input_69.edif
write_json ./69/8input_69.json
