read_verilog 7input_57.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./57/7input_57_yosys
write_edif ./57/7input_57.edif
write_json ./57/7input_57.json
