read_verilog 8input_4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./4/8input_4_yosys
write_edif ./4/8input_4.edif
write_json ./4/8input_4.json
