read_verilog 8input_62.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./62/8input_62_yosys
write_edif ./62/8input_62.edif
write_json ./62/8input_62.json
