read_verilog 7input_97.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./97/7input_97_yosys
write_edif ./97/7input_97.edif
write_json ./97/7input_97.json
