read_verilog 7input_37.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./37/7input_37_yosys
write_edif ./37/7input_37.edif
write_json ./37/7input_37.json
