read_verilog 7input_95.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./95/7input_95_yosys
write_edif ./95/7input_95.edif
write_json ./95/7input_95.json
