read_verilog 8input_22.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./22/8input_22_yosys
write_edif ./22/8input_22.edif
write_json ./22/8input_22.json
