read_verilog 7input_77.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./77/7input_77_yosys
write_edif ./77/7input_77.edif
write_json ./77/7input_77.json
