read_verilog ./Circuits/Graycode/gray64.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Graycode/gray64/gray64_yosys
write_edif ./Circuits/Graycode/gray64/gray64.edif
write_json ./Circuits/Graycode/gray64/gray64.json
