read_verilog 7input_74.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./74/7input_74_yosys
write_edif ./74/7input_74.edif
write_json ./74/7input_74.json
