read_verilog 6input_89.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./89/6input_89_yosys
write_edif ./89/6input_89.edif
write_json ./89/6input_89.json
