read_verilog 8input_19.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./19/8input_19_yosys
write_edif ./19/8input_19.edif
write_json ./19/8input_19.json
