read_verilog 8input_48.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./48/8input_48_yosys
write_edif ./48/8input_48.edif
write_json ./48/8input_48.json
