read_verilog 6input_26.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./26/6input_26_yosys
write_edif ./26/6input_26.edif
write_json ./26/6input_26.json
