read_verilog 7input_47.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./47/7input_47_yosys
write_edif ./47/7input_47.edif
write_json ./47/7input_47.json
