read_verilog 7input_72.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./72/7input_72_yosys
write_edif ./72/7input_72.edif
write_json ./72/7input_72.json
