read_verilog 8input_90.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./90/8input_90_yosys
write_edif ./90/8input_90.edif
write_json ./90/8input_90.json
