read_verilog 6input_43.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./43/6input_43_yosys
write_edif ./43/6input_43.edif
write_json ./43/6input_43.json
