read_verilog 8input_40.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./40/8input_40_yosys
write_edif ./40/8input_40.edif
write_json ./40/8input_40.json
