read_verilog 8input_54.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./54/8input_54_yosys
write_edif ./54/8input_54.edif
write_json ./54/8input_54.json
