read_verilog 6input_71.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./71/6input_71_yosys
write_edif ./71/6input_71.edif
write_json ./71/6input_71.json
