read_verilog 6input_20.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./20/6input_20_yosys
write_edif ./20/6input_20.edif
write_json ./20/6input_20.json
