read_verilog ./Circuits/Graycode/gray16.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Graycode/gray16/gray16_yosys
write_edif ./Circuits/Graycode/gray16/gray16.edif
write_json ./Circuits/Graycode/gray16/gray16.json
