read_verilog 8input_60.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./60/8input_60_yosys
write_edif ./60/8input_60.edif
write_json ./60/8input_60.json
