read_verilog 8input_58.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./58/8input_58_yosys
write_edif ./58/8input_58.edif
write_json ./58/8input_58.json
