read_verilog 6input_5.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./5/6input_5_yosys
write_edif ./5/6input_5.edif
write_json ./5/6input_5.json
