read_verilog 7input_81.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./81/7input_81_yosys
write_edif ./81/7input_81.edif
write_json ./81/7input_81.json
