read_verilog 6input_3.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./3/6input_3_yosys
write_edif ./3/6input_3.edif
write_json ./3/6input_3.json
