read_verilog 7input_10.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./10/7input_10_yosys
write_edif ./10/7input_10.edif
write_json ./10/7input_10.json
