read_verilog 8input_61.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./61/8input_61_yosys
write_edif ./61/8input_61.edif
write_json ./61/8input_61.json
