read_verilog 8input_63.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./63/8input_63_yosys
write_edif ./63/8input_63.edif
write_json ./63/8input_63.json
