read_verilog 8input_6.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./6/8input_6_yosys
write_edif ./6/8input_6.edif
write_json ./6/8input_6.json
