read_verilog 7input_38.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./38/7input_38_yosys
write_edif ./38/7input_38.edif
write_json ./38/7input_38.json
