read_verilog 6input_30.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./30/6input_30_yosys
write_edif ./30/6input_30.edif
write_json ./30/6input_30.json
