read_verilog 6input_100.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./100/6input_100_yosys
write_edif ./100/6input_100.edif
write_json ./100/6input_100.json
