read_verilog 7input_0.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./0/7input_0_yosys
write_edif ./0/7input_0.edif
write_json ./0/7input_0.json
