read_verilog 6input_32.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./32/6input_32_yosys
write_edif ./32/6input_32.edif
write_json ./32/6input_32.json
