read_verilog 7input_27.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./27/7input_27_yosys
write_edif ./27/7input_27.edif
write_json ./27/7input_27.json
