read_verilog 8input_24.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./24/8input_24_yosys
write_edif ./24/8input_24.edif
write_json ./24/8input_24.json
