read_verilog 7input_98.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./98/7input_98_yosys
write_edif ./98/7input_98.edif
write_json ./98/7input_98.json
