read_verilog 7input_88.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./88/7input_88_yosys
write_edif ./88/7input_88.edif
write_json ./88/7input_88.json
