read_verilog 8input_94.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./94/8input_94_yosys
write_edif ./94/8input_94.edif
write_json ./94/8input_94.json
