read_verilog 7input_12.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./12/7input_12_yosys
write_edif ./12/7input_12.edif
write_json ./12/7input_12.json
