read_verilog 6input_73.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./73/6input_73_yosys
write_edif ./73/6input_73.edif
write_json ./73/6input_73.json
