read_verilog 6input_75.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./75/6input_75_yosys
write_edif ./75/6input_75.edif
write_json ./75/6input_75.json
