read_verilog ./Circuits/Graycode/gray.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./Circuits/Graycode/gray/gray_yosys
write_edif ./Circuits/Graycode/gray/gray.edif
write_json ./Circuits/Graycode/gray/gray.json
