read_verilog 8input_49.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./49/8input_49_yosys
write_edif ./49/8input_49.edif
write_json ./49/8input_49.json
