read_verilog 6input_44.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./44/6input_44_yosys
write_edif ./44/6input_44.edif
write_json ./44/6input_44.json
