read_verilog 7input_65.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./65/7input_65_yosys
write_edif ./65/7input_65.edif
write_json ./65/7input_65.json
