read_verilog 8input_23.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./23/8input_23_yosys
write_edif ./23/8input_23.edif
write_json ./23/8input_23.json
