read_verilog 6input_84.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./84/6input_84_yosys
write_edif ./84/6input_84.edif
write_json ./84/6input_84.json
